inventory_service_perf/wrk_report/inventory_python311_read_1200.txt
Running 2m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 36.671ms, rate sampling interval: 101ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    36.65ms   11.31ms 134.91ms   68.61%
    Req/Sec     1.21k   281.12     2.10k    78.49%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   36.13ms
 75.000%   43.68ms
 90.000%   51.58ms
 99.000%   65.79ms
 99.900%   72.51ms
 99.990%  101.95ms
 99.999%  134.78ms
100.000%  135.04ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.022     0.000000            1         1.00
      22.655     0.100000        13148         1.11
      26.687     0.200000        26294         1.25
      30.143     0.300000        39459         1.43
      33.183     0.400000        52649         1.67
      36.127     0.500000        65823         2.00
      37.535     0.550000        72345         2.22
      38.975     0.600000        78926         2.50
      40.479     0.650000        85428         2.86
      42.047     0.700000        92088         3.33
      43.679     0.750000        98613         4.00
      44.575     0.775000       101892         4.44
      45.567     0.800000       105165         5.00
      46.719     0.825000       108476         5.71
      47.999     0.850000       111750         6.67
      49.599     0.875000       114981         8.00
      50.559     0.887500       116666         8.89
      51.583     0.900000       118323        10.00
      52.703     0.912500       119912        11.43
      54.079     0.925000       121578        13.33
      55.487     0.937500       123188        16.00
      56.287     0.943750       124026        17.78
      57.151     0.950000       124833        20.00
      58.079     0.956250       125660        22.86
      59.231     0.962500       126490        26.67
      60.255     0.968750       127296        32.00
      60.831     0.971875       127710        35.56
      61.503     0.975000       128134        40.00
      62.143     0.978125       128544        45.71
      62.943     0.981250       128940        53.33
      63.903     0.984375       129347        64.00
      64.479     0.985938       129567        71.11
      64.959     0.987500       129771        80.00
      65.503     0.989062       129965        91.43
      66.047     0.990625       130171       106.67
      66.687     0.992188       130397       128.00
      66.943     0.992969       130480       142.22
      67.263     0.993750       130579       160.00
      67.647     0.994531       130701       182.86
      67.967     0.995313       130791       213.33
      68.351     0.996094       130907       256.00
      68.479     0.996484       130940       284.44
      68.799     0.996875       130998       320.00
      69.183     0.997266       131045       365.71
      69.567     0.997656       131097       426.67
      70.207     0.998047       131145       512.00
      70.527     0.998242       131170       568.89
      70.911     0.998437       131200       640.00
      71.359     0.998633       131224       731.43
      71.935     0.998828       131249       853.33
      72.575     0.999023       131273      1024.00
      73.215     0.999121       131285      1137.78
      73.727     0.999219       131299      1280.00
      74.367     0.999316       131312      1462.86
      74.879     0.999414       131324      1706.67
      75.455     0.999512       131336      2048.00
      75.967     0.999561       131343      2275.56
      76.351     0.999609       131349      2560.00
      76.991     0.999658       131356      2925.71
      77.503     0.999707       131362      3413.33
      78.143     0.999756       131368      4096.00
      78.591     0.999780       131372      4551.11
      79.807     0.999805       131376      5120.00
      80.447     0.999829       131378      5851.43
      96.447     0.999854       131381      6826.67
     101.183     0.999878       131384      8192.00
     101.823     0.999890       131386      9102.22
     101.951     0.999902       131388     10240.00
     103.615     0.999915       131389     11702.86
     108.095     0.999927       131391     13653.33
     121.535     0.999939       131392     16384.00
     123.135     0.999945       131393     18204.44
     123.199     0.999951       131394     20480.00
     123.775     0.999957       131395     23405.71
     124.095     0.999963       131396     27306.67
     124.095     0.999969       131396     32768.00
     124.415     0.999973       131397     36408.89
     124.415     0.999976       131397     40960.00
     124.927     0.999979       131398     46811.43
     124.927     0.999982       131398     54613.33
     124.927     0.999985       131398     65536.00
     134.783     0.999986       131399     72817.78
     134.783     0.999988       131399     81920.00
     134.783     0.999989       131399     93622.86
     134.783     0.999991       131399    109226.67
     134.783     0.999992       131399    131072.00
     135.039     0.999993       131400    145635.56
     135.039     1.000000       131400          inf
#[Mean    =       36.649, StdDeviation   =       11.308]
#[Max     =      134.912, Total count    =       131400]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  142801 requests in 2.00m, 61.71MB read
Requests/sec:   1189.76
Transfer/sec:    526.49KB