inventory_service_perf/wrk_report/inventory_python311_write_1000.txt
next_player_id is achive 100000 and reset to 1
Running 2m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 33.438ms, rate sampling interval: 179ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.65ms   43.38ms 649.73ms   93.40%
    Req/Sec     1.00k    76.61     1.28k    80.20%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.85ms
 75.000%   18.35ms
 90.000%   49.09ms
 99.000%  237.31ms
 99.900%  474.37ms
 99.990%  588.29ms
 99.999%  648.19ms
100.000%  650.24ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.403     0.000000            1         1.00
       5.647     0.100000        10967         1.11
       7.151     0.200000        21907         1.25
       7.947     0.300000        32875         1.43
       8.399     0.400000        43938         1.67
       8.847     0.500000        54813         2.00
       9.167     0.550000        60291         2.22
       9.759     0.600000        65719         2.50
      11.783     0.650000        71186         2.86
      14.655     0.700000        76656         3.33
      18.351     0.750000        82135         4.00
      19.951     0.775000        84881         4.44
      23.183     0.800000        87609         5.00
      26.655     0.825000        90340         5.71
      31.535     0.850000        93075         6.67
      38.399     0.875000        95830         8.00
      43.167     0.887500        97186         8.89
      49.087     0.900000        98551        10.00
      54.975     0.912500        99918        11.43
      60.799     0.925000       101289        13.33
      69.055     0.937500       102669        16.00
      75.583     0.943750       103342        17.78
      85.375     0.950000       104025        20.00
      93.567     0.956250       104709        22.86
     104.383     0.962500       105393        26.67
     115.839     0.968750       106079        32.00
     123.007     0.971875       106422        35.56
     134.399     0.975000       106764        40.00
     150.527     0.978125       107104        45.71
     166.271     0.981250       107446        53.33
     187.903     0.984375       107793        64.00
     201.215     0.985938       107960        71.11
     214.015     0.987500       108132        80.00
     227.967     0.989062       108303        91.43
     244.607     0.990625       108474       106.67
     264.703     0.992188       108646       128.00
     277.503     0.992969       108731       142.22
     292.351     0.993750       108815       160.00
     305.407     0.994531       108903       182.86
     322.815     0.995313       108986       213.33
     339.199     0.996094       109072       256.00
     350.463     0.996484       109115       284.44
     361.471     0.996875       109157       320.00
     377.855     0.997266       109200       365.71
     389.887     0.997656       109243       426.67
     407.551     0.998047       109286       512.00
     416.255     0.998242       109307       568.89
     425.727     0.998437       109328       640.00
     443.903     0.998633       109350       731.43
     457.983     0.998828       109371       853.33
     477.439     0.999023       109393      1024.00
     484.095     0.999121       109403      1137.78
     492.799     0.999219       109414      1280.00
     497.919     0.999316       109425      1462.86
     504.575     0.999414       109435      1706.67
     513.279     0.999512       109446      2048.00
     528.895     0.999561       109451      2275.56
     534.015     0.999609       109457      2560.00
     546.303     0.999658       109462      2925.71
     557.567     0.999707       109468      3413.33
     563.711     0.999756       109474      4096.00
     565.759     0.999780       109475      4551.11
     575.999     0.999805       109479      5120.00
     578.559     0.999829       109481      5851.43
     581.631     0.999854       109483      6826.67
     587.263     0.999878       109486      8192.00
     587.775     0.999890       109487      9102.22
     599.039     0.999902       109489     10240.00
     600.575     0.999915       109490     11702.86
     603.135     0.999927       109491     13653.33
     605.695     0.999939       109493     16384.00
     605.695     0.999945       109493     18204.44
     606.719     0.999951       109494     20480.00
     609.279     0.999957       109495     23405.71
     609.279     0.999963       109495     27306.67
     613.887     0.999969       109496     32768.00
     613.887     0.999973       109496     36408.89
     616.959     0.999976       109497     40960.00
     616.959     0.999979       109497     46811.43
     616.959     0.999982       109497     54613.33
     648.191     0.999985       109498     65536.00
     648.191     0.999986       109498     72817.78
     648.191     0.999988       109498     81920.00
     648.191     0.999989       109498     93622.86
     648.191     0.999991       109498    109226.67
     650.239     0.999992       109499    131072.00
     650.239     1.000000       109499          inf
#[Mean    =       22.654, StdDeviation   =       43.379]
#[Max     =      649.728, Total count    =       109499]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  119796 requests in 2.00m, 21.25MB read
Requests/sec:    998.30
Transfer/sec:    181.33KB